# =============================================================================
# Core CLI tools
# =============================================================================

# Git - distributed version control system
# https://github.com/git/git
brew "git"

# Delta - syntax-highlighted pager for git diff output
# https://github.com/dandavison/delta
brew "git-delta"

# Lazygit - terminal UI for common Git workflows
# https://github.com/jesseduffield/lazygit
brew "lazygit"

# GitHub CLI - interact with GitHub from terminal
# https://github.com/cli/cli
brew "gh"

# gh-dash - terminal dashboard for GitHub PRs and issues
# https://github.com/dlvhdr/gh-dash
brew "gh-dash"

# ripgrep - fast recursive text search respecting .gitignore
# https://github.com/BurntSushi/ripgrep
brew "ripgrep"

# fd - user-friendly and fast alternative to find
# https://github.com/sharkdp/fd
brew "fd"

# fzf - command-line fuzzy finder
# https://github.com/junegunn/fzf
brew "fzf"

# zoxide - smarter directory jumper for shell navigation
# https://github.com/ajeetdsouza/zoxide
brew "zoxide"

# bat - cat clone with syntax highlighting and git integration
# https://github.com/sharkdp/bat
brew "bat"

# eza - modern ls replacement with git/icons support
# https://github.com/eza-community/eza
brew "eza"

# btop - interactive resource monitor for CPU/memory/disk/network
# https://github.com/aristocratos/btop
brew "btop"

# jq - lightweight command-line JSON processor
# https://github.com/jqlang/jq
brew "jq"

# zellij - modern terminal workspace and multiplexer
# https://github.com/zellij-org/zellij
brew "zellij"

# glow - beautiful markdown renderer for terminal
# https://github.com/charmbracelet/glow
brew "glow"

# HTTPie - friendly HTTP client for the command line
# https://github.com/httpie/cli
brew "httpie"

# GNU Stow - symlink farm manager (used to install dotfiles)
# https://www.gnu.org/software/stow/
brew "stow"

# =============================================================================
# Languages, runtimes, version managers
# =============================================================================

# mise - polyglot version manager (Node, Python, Java, Ruby, etc.)
# https://github.com/jdx/mise
brew "mise"

# OpenJDK 21 - Java Development Kit (LTS)
# https://github.com/openjdk/jdk
brew "openjdk@21"

# Gradle - build automation tool for JVM projects
# https://github.com/gradle/gradle
brew "gradle"

# =============================================================================
# Containers
# =============================================================================

# Docker CLI - containerization platform (CLI only; pair with colima or Docker Desktop)
# https://github.com/docker/docker
brew "docker"

# =============================================================================
# Security / secrets
# =============================================================================

# Bitwarden CLI - command-line interface for Bitwarden
# https://github.com/bitwarden/clients
brew "bitwarden-cli"

# =============================================================================
# Casks (GUI apps)
# =============================================================================

# Raycast - launcher and productivity tool for macOS
# https://github.com/raycast/extensions
cask "raycast"

# Ghostty - GPU-accelerated terminal emulator
# https://github.com/ghostty-org/ghostty
cask "ghostty"

# Karabiner-Elements - advanced keyboard remapping for macOS
# https://github.com/pqrs-org/Karabiner-Elements
cask "karabiner-elements"

# Bitwarden - password manager desktop client
# https://github.com/bitwarden/clients
cask "bitwarden"

# DBeaver - database management tool
# https://github.com/dbeaver/dbeaver
cask "dbeaver-community"

# Studio 3T - MongoDB management tool
# https://github.com/studio-3t/studio-3t
cask "studio-3t"

# Sublime Text - text editor
# https://github.com/sublimehq/sublime_text
cask "sublime-text"

# Visual Studio Code - code editor
# https://github.com/microsoft/vscode
cask "visual-studio-code"

# Stats - menu bar system monitor
# https://github.com/exelban/stats
cask "stats"

# =============================================================================
# Fonts
# =============================================================================

# JetBrains Mono Nerd Font - patched font with icons (used by Ghostty/eza/lazygit)
# https://github.com/ryanoasis/nerd-fonts
cask "font-jetbrains-mono-nerd-font"
